# Use of STR Function in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep = '\t')
orders['item_price'] = orders.item_price.str.replace('$' , '').astype('float')
stocks =  pd.read_csv('http://bit.ly/smallstocks', parse_dates = ['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
#ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates = ['Time'])

C:\Users\skum108\AppData\Local\Temp\ipykernel_6420\3877486901.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$' , '').astype('float')

In [3]:
data = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],    dtype="object")
data

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [4]:
data.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [5]:
data.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [6]:
data.str.title()     # Excel Proper function is same as Pandas Title function

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

In [7]:
data.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

In [8]:
data.value_counts()

A       1
B       1
C       1
Aaba    1
Baca    1
CABA    1
dog     1
cat     1
dtype: int64

# TRIM function - Trim/Left Trim/Right Trim

string methods on Index are especially useful for cleaning up or transforming DataFrame columns. For instance, you may have columns with leading or trailing whitespace:

In [9]:
idx = pd.Index([' jack', 'jill ', ' jesse ', 'frank'])

#### Removing extra spaces from both sides

In [10]:
idx.str.strip()

Index(['jack', 'jill', 'jesse', 'frank'], dtype='object')

####  Removing extra spaces from Left Sides

In [11]:
idx.str.lstrip()

Index(['jack', 'jill ', 'jesse ', 'frank'], dtype='object')

####  Removing extra spaces from Right Sides

In [12]:
idx.str.rstrip()

Index([' jack', 'jill', ' jesse', 'frank'], dtype='object')

####  Multiple STR Function used in one line  (we will create a new dataset (index))

In [13]:
df = pd.DataFrame(np.random.randn(3, 2),columns=[' Column A ', ' Column B '], index=range(3))

In [14]:
df

    Column A    Column B
0    1.044819    0.659313
1   -1.886621   -0.154200
2    0.020556   -0.115725

In [15]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ' , '_')

In [16]:
df

   column_a  column_b
0  1.044819  0.659313
1 -1.886621 -0.154200
2  0.020556 -0.115725

In [17]:
s3 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca',                '', np.nan, 'CABA', 'dog', 'cat'],                dtype="object")

In [18]:
s = pd.Series(['a', 'b', 'c', 'd'], dtype="object")
s

0    a
1    b
2    c
3    d
dtype: object

# Use of str.contains

#### str.contains work as a wild card search , however there is no need to put astreck(*)
It will give True/False - then that code you can put with whole dataframe to fetch data

In [19]:
import pandas as pd
import numpy as np
orders = pd.read_table('http://bit.ly/chiporders')
orders.head(4)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39

In [20]:
orders.item_name.str.contains('Chips')

0        True
1       False
2       False
3        True
4       False
        ...
4617    False
4618    False
4619    False
4620    False
4621    False
Name: item_name, Length: 4622, dtype: bool

In [21]:
orders[orders.item_name.str.contains('Chips')]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
6,3,1,Side of Chips,NaN,$1.69
10,5,1,Chips and Guacamole,NaN,$4.45
14,7,1,Chips and Guacamole,NaN,$4.45
...,...,...,...,...,...
4596,1826,1,Chips and Guacamole,NaN,$4.45
4600,1827,1,Chips and Guacamole,NaN,$4.45
4605,1828,1,Chips and Guacamole,NaN,$4.45
4613,1831,1,Chips,NaN,$2.15
4616,1832,1,Chips and Guacamole,NaN,$4.45

# # Use of str.replace()

In [32]:
import seaborn as sns
sns.get_dataset_names()
titanic = sns.load_dataset('titanic')
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [41]:
titanic['Gender'] = titanic.sex.str.replace('male' , 'm1')
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,m1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,fem1

### str.count = it will count number of charecter in each series item and give number

In [37]:
#titanic.fare = titanic.fare.str.replace('' , '$')
titanic.Gender.str.count('e')

0      1
1      2
2      2
3      2
4      1
      ..
886    1
887    2
888    2
889    1
890    1
Name: Gender, Length: 891, dtype: int64

In [42]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,m1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,fem1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,fem1

# str.find (It is to find any charecter or word from all sereies item - we have option to start search place and end search place)

In [43]:
titanic.Gender.str.find('t',1,2)

0     -1
1     -1
2     -1
3     -1
4     -1
      ..
886   -1
887   -1
888   -1
889   -1
890   -1
Name: Gender, Length: 891, dtype: int64

# str.findall

In [40]:
titanic.Gender.str.findall('fema')

0      []
1      []
2      []
3      []
4      []
       ..
886    []
887    []
888    []
889    []
890    []
Name: Gender, Length: 891, dtype: object

In [37]:
titanic.Gender.str.findall('FEMA')

0      []
1      []
2      []
3      []
4      []
       ..
886    []
887    []
888    []
889    []
890    []
Name: Gender, Length: 891, dtype: object

In [38]:
import re
titanic.Gender.str.findall('Fem' , flags =re.IGNORECASE)

0         []
1      [fem]
2      [fem]
3      [fem]
4         []
       ...
886       []
887    [fem]
888    [fem]
889       []
890       []
Name: Gender, Length: 891, dtype: object

String handling

Series.str can be used to access the values of the series as strings and apply several methods to it. These can be accessed like Series.str.<function/property>.


1. Series.str.cat(self[, others, sep, na_rep, join])  
1. Concatenate strings in the Series/Index with given separator

2. Series.str.center(self, width[, fillchar])
2. Filling left and right side of strings in the Series/Index with an additional character.

3. Series.str.count(self, pat[, flags])
3. Count occurrences of pattern in each string of the Series/Index.

4. Series.str.decode(self, encoding[, errors])
4. Decode character string in the Series/Index using indicated encoding.

5. Series.str.encode(self, encoding[, errors])
6. Encode character string in the Series/Index using indicated encoding.

7. Series.str.endswith(self, pat[, na])
7. Test if the end of each string element matches a pattern.
 
8. Series.str.extract(self, pat[, flags, expand])
8. Extract capture groups in the regex pat as columns in a DataFrame.

9. Series.str.extractall(self, pat[, flags])
9. For each subject string in the Series, extract groups from all matches of regular expression pat.

10. Series.str.find(self, sub[, start, end])
10. Return lowest indexes in each strings in the Series/Index where the substring is fully contained between [start:end].

11. Series.str.findall(self, pat[, flags])
11. Find all occurrences of pattern or regular expression in the Series/Index.
  
12. Series.str.index(self, sub[, start, end])
12. Return lowest indexes in each strings where the substring is fully contained between [start:end].
   
13. Series.str.join(self, sep)
13. Join lists contained as elements in the Series/Index with passed delimiter.